# SubQuery Excercise.

In [3]:
%reload_ext sql

In [4]:
%sql sqlite:///course.db3

### Create 3 Table (Student, Courses, Enrollment)

In [5]:
%%sql
CREATE TABLE students(
student_no INT,
student_name varchar(30),
age INT
);

 * sqlite:///course.db3
(sqlite3.OperationalError) table students already exists [SQL: 'CREATE TABLE students( student_no INT,\nstudent_name varchar(30),\nage INT\n);']

In [8]:
%%sql
CREATE TABLE student_enrollment(
student_no INT,
courses varcar(5)
);

 * sqlite:///course.db3
Done.

[]

In [33]:
%%sql
CREATE TABLE courses(
course_no INT,
course_title varchar(20),
credits INT
)

 * sqlite:///course.db3
Done.

[]

### Fill Tables

In [11]:
%%sql
insert into student_enrollment values(1, 'CS110');
insert into student_enrollment values(1, 'CS180');
insert into student_enrollment values(1, 'CS210');
insert into student_enrollment values(2, 'CS107');
insert into student_enrollment values(2, 'CS220');
insert into student_enrollment values(3, 'CS110');
insert into student_enrollment values(3, 'CS180');
insert into student_enrollment values(4, 'CS220');
insert into student_enrollment values(5, 'CS110');
insert into student_enrollment values(5, 'CS180');
insert into student_enrollment values(5, 'CS210');
insert into student_enrollment values(5, 'CS220');
insert into student_enrollment values(6, 'CS110');
insert into student_enrollment values(7, 'CS110');
insert into student_enrollment values(7, 'CS210');

 * sqlite:///course.db3
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
%%sql
insert into courses values('CS110', 'Pre Calculus', 4);
insert into courses values('CS180', 'Physiscs', 4);
insert into courses values('CS107', 'Intro Physicology', 3);
insert into courses values('CS210', 'Art History', 3);
insert into courses values('CS220', 'US History', 3);

 * sqlite:///course.db3
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

### Question

1. Using subqueries only, write a SQL statement that returns the names of those students that are taking the courses Physics and US History.

In [19]:
%%sql 
SELECT * FROM students

 * sqlite:///course.db3
Done.

[(1, 'Michael', 19),
 (2, 'Doug', 18),
 (3, 'Samantha', 21),
 (4, 'Pete', 20),
 (5, 'Ralph', 19),
 (6, 'Arnold', 22),
 (7, 'Michael', 19),
 (8, 'Jack', 19),
 (9, 'Rand', 17),
 (10, 'Sylvia', 20)]

In [21]:
%%sql
SELECT * FROM students
LIMIT 1

 * sqlite:///course.db3
Done.

[(1, 'Michael', 19)]

In [38]:
%%sql
SELECT * FROM student_enrollment

 * sqlite:///course.db3
Done.

[(1, 'CS110'),
 (1, 'CS180'),
 (1, 'CS210'),
 (2, 'CS107'),
 (2, 'CS220'),
 (3, 'CS110'),
 (3, 'CS180'),
 (4, 'CS220'),
 (5, 'CS110'),
 (5, 'CS180'),
 (5, 'CS210'),
 (5, 'CS220'),
 (6, 'CS110'),
 (7, 'CS110'),
 (7, 'CS210')]

In [36]:
%%sql
SELECT * FROM courses
LIMIT 1

 * sqlite:///course.db3
Done.

[('CS110', 'Pre Calculus', 4)]

In [37]:
%%sql
SELECT student 
FROM students
WHERE student_no IN 
(SELECT student_no FROM student_enrollment WHERE courses IN
(SELECT course_no FROM courses WHERE course_title IN ('Physics','US History')))

 * sqlite:///course.db3
Done.

[('Doug',), ('Pete',), ('Ralph',)]

3. Using subqueries only, write a query that returns the name of the student that is taking the highest number of courses.

In [48]:
%%sql
SELECT student_no,student FROM students
WHERE student_no IN (SELECT student_no
FROM student_enrollment
GROUP BY student_no
ORDER BY COUNT(student_no) desc
LIMIT 1)

 * sqlite:///course.db3
Done.

[(5, 'Ralph')]

4. Write a query to find the student that is the oldest. You are not allowed to use LIMIT or the ORDER BY clause to solve this problem.

In [53]:
%%sql
SELECT * 
FROM students
WHERE age = (SELECT MAX(age) FROM students)

 * sqlite:///course.db3
Done.

[(6, 'Arnold', 22)]